<a href="https://colab.research.google.com/github/mayank1897/assignments/blob/master/datacleaning_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

####1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put inplace. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [5]:
df.FlightNumber.interpolate(inplace=True)

In [6]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [7]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [8]:
df.FlightNumber=df.FlightNumber.astype(int)

In [10]:
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

####2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [11]:
c,l=[],[]
for i in df.From_To:
    a=i.split("_")
    c.append(a[0])
    l.append(a[1])
df_temp=pd.DataFrame({"From":c,"To":l})

In [12]:
df_temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

####3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [13]:
df_temp.loc[:,"From"]=[i.title() for i in df_temp.From]
df_temp.loc[:,"To"]=[i.title() for i in df_temp.To]

In [14]:
df_temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

####4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [15]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [16]:
df.drop("From_To",axis=1,inplace=True)

In [17]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [32]:
df_new=pd.concat([df_temp,df],axis=1)
df_new

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

####5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

In [19]:
c,l=[],[]
for i in df_new.RecentDelays:
    len(i)

In [20]:
a,b,c=[],[],[]
for i in df.RecentDelays:
    if (len(i)==0):
        for k in [a,b,c]:
            k.append(np.nan)
    elif (len(i)==1):
        a.append(i[0])
        for k in [b,c]:
            k.append(np.nan)
    elif (len(i)==2):
        a.append(i[0])
        b.append(i[1])
        c.append(np.nan)
    elif (len(i)==3):
        a.append(i[0])
        b.append(i[1])
        c.append(i[2])

In [22]:
pd.Series(a)

0    23.0
1     NaN
2    24.0
3    13.0
4    67.0
dtype: float64

In [23]:
df_1=pd.concat([pd.Series(a),pd.Series(b),pd.Series(c)],axis=1,keys=["delay_1","delay_2","delay_3"])
df_1

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [ ]:
df_2=pd.concat()

ValueError: ignored

In [33]:
df_new.drop("RecentDelays",axis=1,inplace=True)

In [34]:
df_new

       From         To  FlightNumber              Airline
0    London      Paris         10045               KLM(!)
1    Madrid      Milan         10055    <Air France> (12)
2    London  Stockholm         10065  (British Airways. )
3  Budapest      Paris         10075       12. Air France
4  Brussels     London         10085          "Swiss Air"

In [35]:
pd.concat([df_new,df_1],axis=1,keys=["","delays"])

                                     ...  delays
       From         To FlightNumber  ... delay_1 delay_2 delay_3
0    London      Paris        10045  ...    23.0    47.0     NaN
1    Madrid      Milan        10055  ...     NaN     NaN     NaN
2    London  Stockholm        10065  ...    24.0    43.0    87.0
3  Budapest      Paris        10075  ...    13.0     NaN     NaN
4  Brussels     London        10085  ...    67.0    32.0     NaN

[5 rows x 7 columns]